In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.ExcelFile(r'C:\Users\ashra\Desktop\SDBI Stuff\Python\Files\ALLIMPORTS\ALLIMPORTS\exam 2023\datasets\songs_missing_data_v2.xlsx')

In [3]:
df.sheet_names

['ABC', 'DE', 'FG']

In [4]:
d={}
for i in df.sheet_names:
    d[i]=df.parse(i)

In [5]:
d.keys()

dict_keys(['ABC', 'DE', 'FG'])

In [6]:
df1=pd.DataFrame(d['ABC'])
df2=pd.DataFrame(d['DE'])
df3=pd.DataFrame(d['FG'])

In [7]:
df1.head(3)

    ABC.Date ABC.Song  ABC.Views_on_Youtube  ABC.Total_Views_on_all_platforms
0 2020-12-01        A                   430                              1057
1 2020-12-02        A                   426                              1131
2 2020-12-03        A                   485                              1133

In [8]:
df2.head(3)

     DE.Date DE.Song  DE.Views_on_Youtube  DE.Total_Views_on_all_platforms
0 2020-12-01       D                  184                              934
1 2020-12-02       D                  163                              914
2 2020-12-03       D                  206                              982

In [9]:
df3.head(3)

     FG.Date FG.Song  FG.Views_on_Youtube  FG.Total_Views_on_all_platforms
0 2020-12-01       F                  154                                0
1 2020-12-02       F                  490                             1176
2 2020-12-03       F                  329                                0

In [10]:
df1.rename(columns={'ABC.Date':'Date','ABC.Song':'Song','ABC.Views_on_Youtube':'Views_on_Youtube','ABC.Total_Views_on_all_platforms':'Total_Views_on_all_platforms'},inplace=True)

In [11]:
df2.rename(columns={'DE.Date':'Date','DE.Song':'Song','DE.Views_on_Youtube':'Views_on_Youtube','DE.Total_Views_on_all_platforms':'Total_Views_on_all_platforms'},inplace=True)

In [12]:
df3.rename(columns={'FG.Date':'Date','FG.Song':'Song','FG.Views_on_Youtube':'Views_on_Youtube','FG.Total_Views_on_all_platforms':'Total_Views_on_all_platforms'},inplace=True)

In [13]:
df4=pd.concat([df1,df2])

In [14]:
df5=pd.concat([df4,df3])

In [15]:
df5.shape

(826, 4)

In [16]:
df5

          Date Song  Views_on_Youtube  Total_Views_on_all_platforms
0   2020-12-01    A               430                          1057
1   2020-12-02    A               426                          1131
2   2020-12-03    A               485                          1133
3   2020-12-04    A               125                             0
4   2020-12-05    A               147                           905
..         ...  ...               ...                           ...
231 2020-11-26    G               264                          1043
232 2020-11-27    G               302                             0
233 2020-11-28    G                 0                           766
234 2020-11-29    G               366                          1111
235 2020-11-30    G               428                             0

[826 rows x 4 columns]

In [17]:
df5['Song'].unique()

array(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype=object)

In [18]:
df5.groupby('Song')['Song'].count()

Song
A    118
B    118
C    118
D    118
E    118
F    118
G    118
Name: Song, dtype: int64

In [19]:
pd.pivot_table(df5,index='Song',values='Total_Views_on_all_platforms',aggfunc=['mean','min','max'])

,mean,min,max
,Total_Views_on_all_platforms,Total_Views_on_all_platforms,Total_Views_on_all_platforms
Song,,,
A,792.991525,0,1243
B,813.991525,0,1225
C,725.771186,0,1233
D,835.550847,0,1221
E,798.322034,0,1228
F,835.211864,0,1223
G,750.338983,0,1235

In [20]:
song_miss=df5[(df5['Views_on_Youtube']==0) | (df5['Total_Views_on_all_platforms']==0)]

In [21]:
pd.pivot_table(song_miss[(song_miss['Views_on_Youtube']==0)],index='Song',values=['Views_on_Youtube'],aggfunc='count')

      Views_on_Youtube
Song
A                   17
B                   23
C                   19
D                   21
E                   19
F                   21
G                   20

In [22]:
pd.pivot_table(song_miss[(song_miss['Total_Views_on_all_platforms']==0)],index='Song',values=['Total_Views_on_all_platforms'],aggfunc='count')

      Total_Views_on_all_platforms
Song
A                               26
B                               25
C                               26
D                               20
E                               25
F                               24
G                               30

In [23]:
pd.pivot_table(song_miss[(song_miss['Views_on_Youtube']==0)&(song_miss['Total_Views_on_all_platforms']==0) ],index='Song',values=['Views_on_Youtube','Total_Views_on_all_platforms'],aggfunc='count')

      Total_Views_on_all_platforms  Views_on_Youtube
Song
A                                3                 3
B                                4                 4
C                                3                 3
D                                2                 2
E                                4                 4
F                                3                 3
G                                4                 4

In [24]:
song_miss.shape[0]

293

In [25]:
df5['mean_yt']=df5.groupby('Song')['Views_on_Youtube'].transform('mean')

In [26]:
df5.sample(10)

,Date,Song,Views_on_Youtube,Total_Views_on_all_platforms,mean_yt
123,2021-02-06,B,351,1029,255.898305
347,2020-11-24,C,167,894,206.483051
80,2021-02-21,D,459,0,238.406780
93,2021-02-06,E,0,890,263.076271
53,2020-12-24,G,249,904,252.533898
165,2021-01-20,G,443,0,252.533898
71,2021-02-12,D,141,787,238.406780
117,2021-02-28,A,231,1010,289.398305
7,2020-12-08,D,0,1070,238.406780
61,2021-02-02,F,0,1176,255.525424

In [27]:
df5['Views_on_YouTube']=np.where((df5['Views_on_Youtube']==0),df5['mean_yt'],df5['Views_on_Youtube'])

In [28]:
df5.drop(columns=['mean_yt','Views_on_Youtube'],inplace=True)

In [29]:
df5['mean_p']=df5.groupby('Song')['Total_Views_on_all_platforms'].transform('mean')

In [30]:
df5['Total_Views_on_all_platforms']=np.where((df5['Total_Views_on_all_platforms']==0),df5['mean_p'],df5['Total_Views_on_all_platforms'])

In [63]:
df5.drop(columns=['mean_p'],inplace=True)

In [65]:
df5

          Date Song  Total_Views_on_all_platforms  Views_on_YouTube
0   2020-12-01    A                   1057.000000        430.000000
1   2020-12-02    A                   1131.000000        426.000000
2   2020-12-03    A                   1133.000000        485.000000
3   2020-12-04    A                    792.991525        125.000000
4   2020-12-05    A                    905.000000        147.000000
..         ...  ...                           ...               ...
231 2020-11-26    G                   1043.000000        264.000000
232 2020-11-27    G                    750.338983        302.000000
233 2020-11-28    G                    766.000000        252.533898
234 2020-11-29    G                   1111.000000        366.000000
235 2020-11-30    G                    750.338983        428.000000

[826 rows x 4 columns]